backend/src/test/resources/trias/trip-response-mock.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <Trias xmlns="http://www.vdv.de/trias" version="1.2">
      <ServiceDelivery>
        <ResponseTimestamp>2026-04-02T12:00:00Z</ResponseTimestamp>
        <TripResponse>
          <TripResult>
            <Trip>
              <Duration>PT25M</Duration>
              <TripLeg>
                <LegBoard>
                  <StopPointName>Tullastraße</StopPointName>
                  <TimetabledTime>2026-04-02T14:05:00+01:00</TimetabledTime>
                </LegBoard>
                <LegAlight>
                  <StopPointName>Hbf</StopPointName>
                  <TimetabledTime>2026-04-02T14:30:00+01:00</TimetabledTime>
                </LegAlight>
                <Service>
                  <PublishedLineName>S2</PublishedLineName>
                </Service>
              </TripLeg>
            </Trip>
          </TripResult>
        </TripResponse>
      </ServiceDelivery>
    </Trias>
  </soap:Body>
</soap:Envelope>
